Обработки/Reports/_КраткосрочныеДолгосрочныеЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_КраткосрочныеДолгосрочныеЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_КраткосрочныеДолгосрочныеЦБ/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расшифровка долгосрочных и краткосрочных вложений",
		"0.16",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант	= НастройкиОтчета.Подписант.КонтактноеЛицо;
	ЭтотОбъект.Период		= НастройкиОтчета.Период.ДатаОкончания;
		
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Функция ПолучитьПараметрыШапки()

	НаименованияКлиента = РаботаСОтчетами.ПолноеИКраткоеНаименованиеКлиентаДляДокументов(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	_КлиентДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	_КлиентДоверительногоУправления.ДатаДоговора КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	&ПоследнийРабочийДень КАК ПоследнийРабочийДень,
		|	&КраткоеНаименованиеКлиента КАК УчредительУправления
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &ЮрФизЛицо
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления";
		
	Запрос.УстановитьПараметр("Период", 						ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("ПоследнийРабочийДень", 			НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ЭтотОбъект.Период)));
	Запрос.УстановитьПараметр("ЮрФизЛицо", 						ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация",				 	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("КраткоеНаименованиеКлиента", 	НаименованияКлиента.КраткоеНаименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Процедура Сформировать(Результат) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Результат.Очистить();

	ДанныеСрочностьЦБ = РаботаСОтчетами.ПолучитьДолгосрочныеИКраткосрочныеАктивы(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период);
	Настройка = ДанныеСрочностьЦБ.Настройка;
	Активы = ДанныеСрочностьЦБ.Активы;
	
	//вывод на печать
	Макет = ПолучитьМакет("Макет");
	
	ПараметрыШапки = ПолучитьПараметрыШапки();			
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ОбластьШапка.Параметры.ДатаДоговора	= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьШапка.Параметры.ПериодОтчета = Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");
	Результат.Вывести(ОбластьШапка);	
	
	//активы
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	Результат.Вывести(ОбластьЗаголовок);
	
	ОбластьСтр = Макет.ПолучитьОбласть("Стр");
	ОбластьСтрРЕПО = Макет.ПолучитьОбласть("СтрРЕПО");
	ОбластьЦБ = Макет.ПолучитьОбласть("ГрЦБ");
	ОбластьРынок = Макет.ПолучитьОбласть("ГрРынок");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ОбластьПроверка = Макет.ПолучитьОбласть("Проверка");
	
		                        
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ВнешняяТаблица.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ВнешняяТаблица.Партия КАК Партия,
	|	_ВнешняяТаблица.СтрокаПартии КАК СтрокаПартии,
	|	_ВнешняяТаблица.вРЕПО КАК вРЕПО,
	|	_ВнешняяТаблица.поРЕПО КАК поРЕПО,
	|	_ВнешняяТаблица.КоличествоОстаток КАК КоличествоОстаток,
	|	_ВнешняяТаблица.Стоимость КАК Стоимость,
	|	_ВнешняяТаблица.РезервПодОбесцение КАК РезервПодОбесцение,	
	|	_ВнешняяТаблица.СтоимостьКупона КАК СтоимостьКупона,
	|	_ВнешняяТаблица.ДатаПокупки КАК ДатаПокупки,
	|	_ВнешняяТаблица.ДатаПогашения КАК ДатаПогашения,
	|	_ВнешняяТаблица.ОтчетнаяДата КАК ОтчетнаяДата,
	|	_ВнешняяТаблица.ДатаНачалаКупона КАК ДатаНачалаКупона,
	|	_ВнешняяТаблица.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
	|	_ВнешняяТаблица.Рынок КАК Рынок,
	|	_ВнешняяТаблица.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_ВнешняяТаблица.ВидАктиваКупон КАК ВидАктиваКупон,
	|	_ВнешняяТаблица.КлассификацияПоСрочностиЦБ КАК КлассификацияПоСрочностиЦБ,
	|	_ВнешняяТаблица.КлассификацияПоСрочностиКупон КАК КлассификацияПоСрочностиКупон,
	|	_ВнешняяТаблица.ЦБКраткосрочная КАК ЦБКраткосрочная,
	|	_ВнешняяТаблица.КупонКраткосрочный КАК КупонКраткосрочный,
	|	_ВнешняяТаблица.СуммаКраткосрочная КАК СуммаКраткосрочная,
	|	_ВнешняяТаблица.СуммаДолгосрочная КАК СуммаДолгосрочная
	|ПОМЕСТИТЬ _Активы
	|ИЗ
	|	&ВнешняяТаблица КАК _ВнешняяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Активы.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_Активы.СтрокаПартии КАК СтрокаПартии,
	|	_Активы.КоличествоОстаток КАК КоличествоОстаток,
	|	_Активы.вРЕПО КАК вРЕПО,
	|	_Активы.поРЕПО КАК поРЕПО,
	|	_Активы.Стоимость КАК Стоимость,
	|	_Активы.РезервПодОбесцение КАК РезервПодОбесцение,	
	|	_Активы.СтоимостьКупона КАК СтоимостьКупона,
	|	_Активы.ДатаПокупки КАК ДатаПокупки,
	|	_Активы.ДатаПогашения КАК ДатаПогашения,
	|	_Активы.ОтчетнаяДата КАК ОтчетнаяДата,
	|	_Активы.ДатаНачалаКупона КАК ДатаНачалаКупона,
	|	_Активы.ДатаОкончанияКупона КАК ДатаОкончанияКупона,
	|	_Активы.Рынок КАК Рынок,
	|	_Активы.ВидАктиваЦБ КАК ВидАктиваЦБ,
	|	_Активы.ВидАктиваКупон КАК ВидАктиваКупон,
	|	_Активы.КлассификацияПоСрочностиЦБ КАК КлассификацияПоСрочностиЦБ,
	|	_Активы.КлассификацияПоСрочностиКупон КАК КлассификацияПоСрочностиКупон,
	|	_Активы.ЦБКраткосрочная КАК ЦБКраткосрочная,
	|	_Активы.КупонКраткосрочный КАК КупонКраткосрочный,
	|	_Активы.СуммаКраткосрочная КАК СуммаКраткосрочная,
	|	_Активы.СуммаДолгосрочная КАК СуммаДолгосрочная
	|ИЗ
	|	_Активы КАК _Активы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеннаяБумага,
	|	вРЕПО,
	|	ДатаПокупки
	|ИТОГИ
	|	СУММА(КоличествоОстаток),
	|	СУММА(Стоимость),
	|	СУММА(РезервПодОбесцение),	
	|	СУММА(СтоимостьКупона),
	|	СУММА(СуммаКраткосрочная),
	|	СУММА(СуммаДолгосрочная)
	|ПО
	|	ОБЩИЕ,
	|	Рынок,
	|	ЦеннаяБумага
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Параметры.Вставить("ВнешняяТаблица", Активы);
	
	ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИтог.Следующий() Цикл 
		ВыборкаРынок = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРынок.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(ОбластьРынок.Параметры, ВыборкаРынок);
			Результат.Вывести(ОбластьРынок);
			Результат.НачатьГруппуСтрок("Рынок");

			ВыборкаЦБ = ВыборкаРынок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЦБ.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластьЦБ.Параметры, ВыборкаЦБ);
				Результат.Вывести(ОбластьЦБ);
		
				ВыборкаПартия = ВыборкаЦБ.Выбрать(ОбходРезультатаЗапроса.Прямой);			
				Результат.НачатьГруппуСтрок("Партии");
				Пока ВыборкаПартия.Следующий() Цикл 
					Если ВыборкаПартия.вРЕПО ИЛИ ВыборкаПартия.ПоРЕПО Тогда
						Если ВыборкаПартия.вРЕПО И ВыборкаПартия.ПоРЕПО  Тогда
							СтатусПартии = "Куплена по РЕПО и продана в РЕПО";
						ИначеЕсли ВыборкаПартия.вРЕПО И НЕ ВыборкаПартия.ПоРЕПО  Тогда
							СтатусПартии = "Продана в РЕПО";
						ИначеЕсли НЕ ВыборкаПартия.вРЕПО И ВыборкаПартия.ПоРЕПО  Тогда	
							СтатусПартии = "Куплена по РЕПО";
						КонецЕсли;	
						ЗаполнитьЗначенияСвойств(ОбластьСтрРЕПО.Параметры, ВыборкаПартия);	
						ОбластьСтрРЕПО.Параметры.Статус = СтатусПартии;
						Результат.Вывести(ОбластьСтрРЕПО);	
					Иначе				
						ЗаполнитьЗначенияСвойств(ОбластьСтр.Параметры, ВыборкаПартия);	
						Результат.Вывести(ОбластьСтр);
					КонецЕсли;	
				КонецЦикла;
				Результат.ЗакончитьГруппуСтрок();
			КонецЦикла;
			Результат.ЗакончитьГруппуСтрок();
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, ВыборкаИтог);
		Результат.Вывести(ОбластьИтог);
	КонецЦикла;	
	
	ОблатьПустая = Макет.ПолучитьОбласть("ПустаяСтрока");
	Результат.Вывести(ОблатьПустая);	
	
	//проверка
	СуммаОтчет = ДанныеСрочностьЦБ.СуммаКраткосрочная + ДанныеСрочностьЦБ.СуммаДолгосрочная;
	СуммаБаланс = ДанныеСрочностьЦБ.СуммаБаланс;
	СуммаРасхождение = СуммаБаланс - СуммаОтчет;
	ОбластьПроверка.Параметры.СуммаОтчет = СуммаОтчет;
	ОбластьПроверка.Параметры.СуммаБаланс = СуммаБаланс;
	ОбластьПроверка.Параметры.СуммаРасхождение = СуммаРасхождение;
	Результат.Вывести(ОбластьПроверка);
	
	ОблатьПустая = Макет.ПолучитьОбласть("ПустаяСтрока");
	Результат.Вывести(ОблатьПустая);	
	
	//настройки
	ОбластьНастройкаШапка = Макет.ПолучитьОбласть("НастройкаШапка");
	Результат.Вывести(ОбластьНастройкаШапка);
	ОбластьНастройка = Макет.ПолучитьОбласть("СтрНастройка");
	Для Каждого СтрокаНастройка из Настройка Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьНастройка.Параметры, СтрокаНастройка);	
		Результат.Вывести(ОбластьНастройка);
	КонецЦикла;
	
	ОблатьДопИнфо = Макет.ПолучитьОбласть("ДопИнфо");
	Результат.Вывести(ОблатьДопИнфо);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Подписант) Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Ответственный",	ЭтотОбъект.Подписант);
		
		Запрос.Текст =
		#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Должность КАК Должность,
		|	КонтактныеЛица.ОснованиеПолномочий КАК ОснованиеПолномочий,
		|	КонтактныеЛица.КонтактноеЛицо.Наименование КАК Ответственный
		|ИЗ
		|	РегистрСведений.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	(КонтактныеЛица.Подразделение, КонтактныеЛица.Язык, КонтактныеЛица.Объект, КонтактныеЛица.КонтактноеЛицо) В
		|			(ВЫБРАТЬ
		|				ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний) КАК Подразделение,
		|				ЗНАЧЕНИЕ(Справочник.Языки.Русский) КАК Язык,
		|				Организации.ЮрФизЛицо КАК Объект,
		|				&Ответственный КАК КонтактноеЛицо
		|			ИЗ
		|				Справочник.Организации КАК Организации
		|			ГДЕ
		|				Организации.Ссылка = &Организация)";
		#КонецОбласти
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ОбластьПодпись = Макет.ПолучитьОбласть("Подпись");
			ОбластьПодпись.Параметры.Должность = Выборка.Должность + ?(ЗначениеЗаполнено(Выборка.ОснованиеПолномочий), " (на основании " + Выборка.ОснованиеПолномочий + ")", "");
			ОбластьПодпись.Параметры.Ответственный = Выборка.Ответственный;			
			Результат.Вывести(ОбластьПодпись);
			
		КонецЕсли;
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
